# Extracting data to SQLite...

### 1)  Load the SQLite package...

In [24]:
import sqlite3

print(sqlite3.version)
print(sqlite3.sqlite_version)

2.6.0
3.35.4

### 2) Connect to the database.

In [25]:
slconn = sqlite3.connect('try.db') # permanent database

In [26]:
print(slconn)

<sqlite3.Connection object at 0x7fb27a92f300>

### 3)  Create a cursor to execute statements to SQLite.

In [27]:
cursor = slconn.cursor()

In [28]:
cursor

In [29]:
from sqlalchemy import create_engine

# connection string: driver://username:password@server/database
engine = create_engine('postgresql+psycopg2://postgres:bryan@localhost/try')

In [30]:
import pandas as pd

def get_columns(tablename):
    return pd.read_sql_query('''select ordinal_position, column_name, data_type  
                                from information_schema.columns 
                                where table_name = '{}'  
                             ''' .format(tablename)
                             ,engine)

In [31]:
get_columns('sales')

    ordinal_position            column_name         data_type
0                  1                  index            bigint
1                  2             ProductKey            bigint
2                  3           OrderDateKey            bigint
3                  4             DueDateKey            bigint
4                  5            ShipDateKey            bigint
5                  6            CustomerKey            bigint
6                  7           PromotionKey            bigint
7                  8            CurrencyKey            bigint
8                  9      SalesTerritoryKey            bigint
9                 10       SalesOrderNumber              text
10                11   SalesOrderLineNumber            bigint
11                12         RevisionNumber            bigint
12                13          OrderQuantity            bigint
13                14              UnitPrice  double precision
14                15         ExtendedAmount  double precision
15                16   UnitPriceDiscountPct            bigint
16                17         DiscountAmount            bigint
17                18    ProductStandardCost  double precision
18                19       TotalProductCost  double precision
19                20            SalesAmount  double precision
20                21                 TaxAmt  double precision
21                22                Freight  double precision
22                23  CarrierTrackingNumber  double precision
23                24       CustomerPONumber  double precision
24                25              OrderDate              text
25                26                DueDate              text
26                27               ShipDate              text

## Let's extract data from the backend databases, and do some data munging to add value.

In [32]:
sql = '''
select c."TotalChildren" as numchildren, 
       c."EnglishEducation" as education, 
       c."MaritalStatus" as maritalstatus, 
       c."EnglishOccupation" as occupation, 
       DATE_PART('year', current_date::date) - DATE_PART('year', "BirthDate"::date) as age,
       "SalesAmount" as salesamount
from sales          s
join customer       c
on (s."CustomerKey" = c."CustomerKey" )
'''

In [33]:
pd.read_sql_query(sql, engine).head(2)

   numchildren    education maritalstatus  occupation   age  salesamount
0            5    Bachelors             S  Management  69.0      3578.27
1            3  High School             S      Manual  51.0      3399.99

In [34]:
salesdatadf = pd.read_sql_query(sql, engine)

In [35]:
# Store the results in our SQLite data warehouse

# if_exists options are replace, append, 
salesdatadf.to_sql('salesdata', con=slconn, index=False, if_exists='replace')

#### Getting meta data...

In [36]:
salesdatadf.columns

Index(['numchildren', 'education', 'maritalstatus', 'occupation', 'age',
       'salesamount'],
      dtype='object')

In [37]:
salesdatadf.dtypes

numchildren        int64
education         object
maritalstatus     object
occupation        object
age              float64
salesamount      float64
dtype: object

In [38]:
# Get table schema...
import pandas as pd 

pd.read_sql_query("""
PRAGMA table_info('salesdata');
""", slconn)

   cid           name     type  notnull dflt_value  pk
0    0    numchildren  INTEGER        0       None   0
1    1      education     TEXT        0       None   0
2    2  maritalstatus     TEXT        0       None   0
3    3     occupation     TEXT        0       None   0
4    4            age     REAL        0       None   0
5    5    salesamount     REAL        0       None   0

### Querying data in SQLite...

In [39]:
import sqlite3
import pandas as pd

pd.read_sql_query("SELECT * FROM salesdata", slconn).head(4).round(0)

   numchildren        education maritalstatus    occupation   age  salesamount
0            5        Bachelors             S    Management  69.0       3578.0
1            3      High School             S        Manual  51.0       3400.0
2            5      High School             S  Professional  69.0       3400.0
3            4  Graduate Degree             M    Management  78.0        699.0

In [49]:
# Formatting output in Post5greSQL -  https://www.postgresql.org/docs/8.3/functions-formatting.html
# Formatting numbers with SQLite - https://stackoverflow.com/questions/48716160/how-to-format-a-float-number-in-sqlite

pd.read_sql_query('''select education,age, printf('%,d', sum(salesamount)) as sales 
                     from salesdata 
                     group by education
                     order by age
                  ''', slconn, index_col='education')

                      age      sales
education
High School          51.0  4,638,026
Partial High School  51.0  1,636,405
Partial College      61.0  7,723,542
Bachelors            69.0  9,900,142
Graduate Degree      78.0  5,460,560

# Let's close the connection.

In [22]:
#pgconn.close()
engine.dispose()
slconn.close()